<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"8b4ff13083a3b5f82dbcd60059911abd505f33c18bd25d0e8616a9664af9c911","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #926 at https://github.com/cal-itp/data-infra/actions/runs/19124460139","plan_out_hash":"64983c0f53bda9f895d8e429b180f9a98634957d3b436b572dfa487f93b702ab","plan_hash":"247355d2d68f012dd888f6d4ad175304c85a8724cc73179ee37a61f6a3cafffb","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "5Duabg==" -> (known after apply)
!~      detect_md5hash      = "aM4+nJcpnSIHF/Gha4FWjA==" -> "different hash"
!~      generation          = 1762371058138456 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "aM4+nJcpnSIHF/Gha4FWjA==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/benefits/_mart_benefits.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "/bAzyg==" -> (known after apply)
!~      detect_md5hash      = "Prx7c4IxgDMgw+Po6fnmEA==" -> "different hash"
!~      generation          = 1754938421540880 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/benefits/_mart_benefits.yml"
!~      md5hash             = "Prx7c4IxgDMgw+Po6fnmEA==" -> (known after apply)
        name                = "data/warehouse/models/mart/benefits/_mart_benefits.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/benefits/fct_benefits_events.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "nH3www==" -> (known after apply)
!~      detect_md5hash      = "OBSSkvprb5n9Ku1SrsDS7A==" -> "different hash"
!~      generation          = 1755876748862218 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/benefits/fct_benefits_events.sql"
!~      md5hash             = "OBSSkvprb5n9Ku1SrsDS7A==" -> (known after apply)
        name                = "data/warehouse/models/mart/benefits/fct_benefits_events.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "PPo7+g==" -> (known after apply)
!~      detect_md5hash      = "r/k10Ywr1hTbn5Lz4ZJkZg==" -> "different hash"
!~      generation          = 1762371060308584 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "r/k10Ywr1hTbn5Lz4ZJkZg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #926](https://github.com/cal-itp/data-infra/actions/runs/19124460139)